usage.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs Usage</title>
<!-- 2016-06-11 Sat 13:56 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="mxn" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs Usage</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Emacs Basic Commands and Functionality</a></li>
<li><a href="#sec-2">2. To be sorted</a>
<ul>
<li>
<ul>
<li><a href="#sec-2-0-1">2.0.1. Working with Log Files</a></li>
<li><a href="#sec-2-0-2">2.0.2. TRAMP: Remote File Editing</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Emacs Basic Commands and Functionality</h2>
<div class="outline-text-2" id="text-1">
<p>
Things that I tend to forget after a while, and which are good to revisit from time to time.
</p>

<p>
<b>Starting Emacs options</b>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><code>-nw</code></td>
<td class="left">terminal mode</td>
</tr>

<tr>
<td class="left"><code>-q</code></td>
<td class="left">do not load an init file</td>
</tr>

<tr>
<td class="left"><code>-Q</code></td>
<td class="left">do not load any startup files (site-wide; X resorces, your init)</td>
</tr>
</tbody>
</table>

<p>
<b>Keys</b>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><code>C-</code></td>
<td class="left">Control</td>
</tr>

<tr>
<td class="left"><code>M-</code></td>
<td class="left">Meta (Alt)</td>
</tr>

<tr>
<td class="left"><code>S-</code></td>
<td class="left">Shift</td>
</tr>

<tr>
<td class="left"><code>s-</code></td>
<td class="left">Super</td>
</tr>

<tr>
<td class="left"><code>H-</code></td>
<td class="left">Hyper</td>
</tr>

<tr>
<td class="left"><code>A-</code></td>
<td class="left">Alt (redundant; not used)</td>
</tr>
</tbody>
</table>

<p>
<b>Universal Arguments</b> Worth learning to use them (including digit and
negative arguments). Note the flexebility to maintain your tempo.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><code>C-u</code></td>
<td class="left">digit argument                    4</td>
</tr>

<tr>
<td class="left"><code>C-u C-u</code></td>
<td class="left">digit argument 16</td>
</tr>

<tr>
<td class="left"><code>C-u</code> <code>...</code></td>
<td class="left">digit argument \(4^n\)</td>
</tr>

<tr>
<td class="left"><code>M-0</code> or <code>C-0</code> to <code>M-9</code> or <code>C-9</code></td>
<td class="left">digit argument 0 to 9</td>
</tr>

<tr>
<td class="left"><code>C--</code> or <code>M--</code> or <code>C-M--</code></td>
<td class="left">negative argument</td>
</tr>
</tbody>
</table>

<p>
<b>Elisp Code</b>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><code>M-x eval buffer</code></td>
<td class="left">evaluate buffer</td>
</tr>

<tr>
<td class="left"><code>M-x eval-region</code></td>
<td class="left">evaluate region</td>
</tr>
</tbody>
</table>

<p>
<b>Package Management</b>
</p>

<p>
Add the <code>ELPA</code> (official), and <code>Melpa</code> and <code>Marmelade</code> (unofficial)
package repositories to your init file. The inofficial sites might go
down. Check the Emacs Wiki if problems appear.
</p>

<p>
<b>The Info Manual</b>
</p>

<p>
It's immensly useful to get information fast and convenient. It's
worth knowing the basic keybindings:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><code>[</code> and <code>]</code></td>
<td class="left">Previous / next node</td>
</tr>

<tr>
<td class="left"><code>l</code> and <code>r</code></td>
<td class="left">Go back / forward in history</td>
</tr>

<tr>
<td class="left"><code>p</code> and <code>n</code></td>
<td class="left">Previous / next sibling mode</td>
</tr>

<tr>
<td class="left"><code>u</code></td>
<td class="left">Goes up one level</td>
</tr>

<tr>
<td class="left"><code>SPC</code></td>
<td class="left">Scroll one screen at a time</td>
</tr>

<tr>
<td class="left"><code>TAB</code></td>
<td class="left">Cycles through links</td>
</tr>

<tr>
<td class="left"><code>RET</code></td>
<td class="left">Opens link</td>
</tr>

<tr>
<td class="left"><code>m</code></td>
<td class="left">Prompts for a menu item name to open</td>
</tr>
</tbody>
</table>

<p>
<b>Emacs Help</b>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><code>C-a</code></td>
<td class="left">Apropos command</td>
</tr>

<tr>
<td class="left"><code>C-h m</code></td>
<td class="left">Info on major/minor mode (check it!)</td>
</tr>

<tr>
<td class="left"><code>C-h f</code></td>
<td class="left">Info on function</td>
</tr>

<tr>
<td class="left"><code>C-h v</code></td>
<td class="left">Info on variable</td>
</tr>

<tr>
<td class="left"><code>C-h k</code></td>
<td class="left">Info on keybding</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> To be sorted</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-0-1" class="outline-4">
<h4 id="sec-2-0-1"><span class="section-number-4">2.0.1</span> Working with Log Files</h4>
<div class="outline-text-4" id="text-2-0-1">
<p>
Emacs has an <i>auto compression mode</i> that automatically de-compresses
and re-compresses files when you open and save them. Combined with
<code>M-x dired</code> one can browse compressed archives like directories.
</p>

<p>
The auto-revert mode can be very useful as well to monitor changing files.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><code>C-x C-r</code></td>
<td class="left">Open file in read-only mode</td>
</tr>

<tr>
<td class="left"><code>C-x C-q</code></td>
<td class="left">Toggle read-only mode</td>
</tr>

<tr>
<td class="left"><code>M-x flush-lines</code></td>
<td class="left">Flush lines matching a pattern</td>
</tr>

<tr>
<td class="left"><code>M-x keep-lines</code></td>
<td class="left">Keep only lines matching a pattern</td>
</tr>

<tr>
<td class="left"><code>M-s o</code></td>
<td class="left">List lines matching a pattern</td>
</tr>

<tr>
<td class="left"><code>M-s h p</code></td>
<td class="left">Highlight a phrase</td>
</tr>

<tr>
<td class="left"><code>M-s h r</code></td>
<td class="left">Highlight regular expression</td>
</tr>

<tr>
<td class="left"><code>M-s h .</code></td>
<td class="left">Highlight symbol at the point</td>
</tr>

<tr>
<td class="left"><code>M-s h u</code></td>
<td class="left">Removes highlighting under point</td>
</tr>

<tr>
<td class="left"><code>M-x auto-revert-mode</code></td>
<td class="left">Reverts buffer when file changes</td>
</tr>

<tr>
<td class="left"><code>M-x auto-revert-tail-mode</code></td>
<td class="left">Appends changes and follows; similar to <code>tail -f</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2-0-2" class="outline-4">
<h4 id="sec-2-0-2"><span class="section-number-4">2.0.2</span> TRAMP: Remote File Editing</h4>
<div class="outline-text-4" id="text-2-0-2">
<p>
First, change the default protocol <code>tramp-default-method</code> to use
<code>ssh</code>. The TRAMP connections follow the syntax:
</p>
<pre class="example">
/ssh:[user@]hostname[#port]:path
</pre>
<p>
where <code>user</code> and <code>port</code> are optional, and tramp uses the <code>.ssh/config</code>
configuration as well.
</p>

<p>
One can start shells on the remote host and execute a lot of other commands.
</p>

<p>
Add as well the <code>sudo</code> command to the init file to switch to the sudo
mode when editing a file.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: mxn</p>
<p class="date">Created: 2016-06-11 Sat 13:56</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
